app/Controllers/Apicontroller.php

SELECT *
FROM `vendas`
LEFT JOIN `pessoas` ON `vendas`.`cpf` = `pessoas`.`cpf`
WHERE `data_viagem` >= curdate()
AND `hora_embarque` > now()
 LIMIT 5
---
  public function listarCheckin()
  {
    $data = $this->vendaModel->where('data_viagem >= curdate()')
                                    ->where('hora_embarque > now()')
                                    ->join('pessoas','vendas.cpf = pessoas.cpf','left')
                                    ->findAll(5);