app/Controllers/HomeController.php

  public function index()
  {
    if(! session('user')){
        return redirect()->to('login');
        exit;
    }

    $empresa = new EmpresaModel();
    $data = [
      'empresa'         => $empresa->first(),
      'menu_active'     => 'home',
      'submenu_active'  => '',
      'title'           => 'Home',

    ];
---
SELECT *
FROM `empresa`
 LIMIT 1